Repository: bmartin042503/avallama
Catalog: avallama/Assets/Localization/Resources.*.resx
Languages: hu

source: Cancel
hu: Vissza

source: Get started
hu: Vágjunk bele

# GREETING_SUBTEXT
source: Run any open source LLM locally
hu: Futtass bármilyen LLM modellt lokálisan

source: Save
hu: Mentés

source: Settings
hu: Beállítások

# TOKEN_SEC
source: tokens/sec
hu: token/mp

# ONLY_SUPPORTED_MODEL
source: Currently the only supported model is {0}
hu: Jelenleg csak a(z) {0} modell támogatott

# SEND_MESSAGE
source: Send a message..
hu: Küldj üzenetet..

# LOW_VRAM_WARNING
source: This model is not running optimally on your system due to low avaliable VRAM
hu: Ez a modell nem fut optimálisan a rendszereden alacsony elérhető VRAM miatt.

# OLLAMA_STARTED
source: Ollama has been successfully started
hu: Az Ollama sikeresen elindult

# OLLAMA_FAILED
source: An error occurred while starting ollama: {0}
hu: Hiba történt az ollama elindítása során: {0}

# OLLAMA_STARTING
source: Starting Ollama..
hu: Ollama indítása folyamatban..

# OLLAMA_ALREADY_RUNNING
source: Ollama is already running
hu: Az Ollama már fut

# UNKNOWN_ERROR
source: An unknown error occured
hu: Ismeretlen hiba történt

# MULTIPLE_INSTANCES_ERROR
source: Multiple instances of Ollama are running. Please close all instances and restart the app.
hu: Több Ollama példány fut. Zárd be az összeset, majd indítsd újra az alkalmazást.

# OLLAMA_NOT_INSTALLED
source: Ollama is not installed
hu: Az Ollama nincs telepítve

# GENERATING_MESSAGE
source: Generating response...
hu: Generálás folyamatban...

# NOT_DOWNLOADED_WARNING
source: No downloaded models found, download models through the Model Manager
hu: Nincs letöltött modell, tölts le modellt a Modellkezelő felületen

source: Loading models...
hu: Modellek töltése...

source: Starting download...
hu: Letöltés indítása...

source: Verifying download...
hu: Letöltés ellenőrzése...

source: New conversation
hu: Új csevegés

source: Search..
hu: Keresés..

source: New
hu: Új

# VERSION_LABEL
source: Version:
hu: Verzió:

# SHORT_DESC
source: A user-friendly GUI for Ollama
hu: Egy felhasználóbarát GUI az Ollama-hoz

source: Developers:
hu: Fejlesztők:

# DEVELOPER_NAMES
source: Márk Csörgő and Martin Bartos
hu: Csörgő Márk és Bartos Martin

# TECH_USED
source: Technologies used:
hu: Felhasznált technológiák:

# LICENSE
source: MIT License, see LICENSE file for details
hu: MIT licensz, részletekért tekintsd meg a LICENSE fájlt

# FROM_ORG
source: From the 4foureyes organization
hu: A 4foureyes csapattól

source: Close
hu: Bezárás

# LANGUAGE_SETTING_DESC
source: Changes the application language
hu: Az alkalmazás nyelvének megváltoztatása

# COLOR_SCHEME_SETTING
source: Color scheme
hu: Színséma

# LANGUAGE_SETTING
source: Language
hu: Nyelv

# COLOR_SCHEME_SETTING_DESC
source: The color scheme of the app
hu: Az alkalmazás színsémája

# LIGHT_THEME
source: Light
hu: Világos

# DARK_THEME
source: Dark
hu: Sötét

# RESTART_NEEDED_DIALOG_TITLE
source: Some changes will take effect after restarting the application
hu: Néhány változtatás érvényesítéséhez újra kell indítani az alkalmazást

# SETTINGS_SAVED
source: Changes are saved
hu: Változtatások mentve

source: About
hu: Névjegy

# DOWNLOAD_OLLAMA
source: Download Ollama ({0})
hu: Ollama letöltése ({0})

source: Skip guide
hu: Útmutató kihagyása

source: Next
hu: Tovább

source: Skip
hu: Kihagyás

# GUIDE_ITEM_1_TITLE
source: Start a new conversation with just one click
hu: Indíts új beszélgetést egyetlen kattintással

# GUIDE_ITEM_1_DESCRIPTION
source: Your data is stored locally, fully private and secure
hu: Minden adat lokálisan van tárolva, biztonságban

# GUIDE_ITEM_2_TITLE
source: Explore and use different AI models
hu: Tölts le különböző AI modelleket

# GUIDE_ITEM_3_TITLE
source: Quick and easy access to all settings
hu: Egyszerű, és személyreszabható

# COMING_SOON
source: Coming soon with more features..
hu: Hamarosan elérhető további funkciókkal..

# THANK_YOU
source: Thank you for trying avallama!
hu: Köszönjük, hogy kipróbálod az avallamát!

source: Model manager
hu: Modellkezelő

# MODEL_PARAMETER_SIZE
source: Parameters: {0}B
hu: {0} milliárd paraméter

# NOT_ENOUGH_SPACE_DOWNLOAD
source: Not enough space to download
hu: Nincs elég hely a letöltéshez

source: Search for models..
hu: Modellek keresése..

source: Insufficient VRAM
hu: Nincs elég VRAM

source: Runs okay
hu: Jól fut

source: Runs great
hu: Nagyszerűen fut

source: Start
hu: Kezdés

# ERROR_DIALOG_TITLE
source: An error has occurred
hu: Hiba történt

# SCROLL_TO_BOTTOM_SETTING
source: Scroll to bottom
hu: Lefelé görgetés

# SCROLL_AUTOMATIC
source: Automatic
hu: Automatikus

# SCROLL_FLOATING
source: Floating button
hu: Felugró gomb

source: None
hu: Egyik sem

# SCROLL_TO_BOTTOM_SETTING_DESC
source: Scroll behavior on new message
hu: Görgetési beállítás új üzenet esetén

# API_HOST_SETTING_DESC
source: IP address of Ollama host machine (default is localhost)
hu: Ollama host számítógép IP címe (alapértelmezetten localhost)

# API_PORT_SETTING_DESC
source: Exposed port of the Ollama host machine (default is 11434)
hu: Elérhető portja az Ollama host számítógépnek (alapértelmezetten 11434)

# INVALID_HOST_ERR
source: Ollama API host is invalid, please enter a valid address. (IPv4 or "localhost")
hu: Érvénytelen Ollama API host, kérlek adj meg egy érvényes címet. (IPv4 vagy "localhost")

# INVALID_PORT_ERR
source: Ollama API port is invalid, please enter a valid port. (1 - 65535)
hu: Érvénytelen Ollama API port! A portnak 1 és 65535 között kell lennie.

# OLLAMA_CONNECTION_ERROR
source: Could not establish connection with the Ollama host machine. The host settings may not be configured correctly.
hu: Nem sikerült kapcsolatot teremteni az Ollama host számítógéppel. Elképzelhető, hogy a host beállítások nincsenek megfelelően konfigurálva.

source: Popular models
hu: Kiemelt modellek

# OLLAMA_RUN_FROM_DIALOG_TITLE
source: Where would you like to start Ollama from?
hu: Honnan szeretnéd indítani az Ollamát?

# OLLAMA_RUN_FROM_DIALOG_DESC
source: You can run Ollama locally on your device or connect to a remote server.
hu: Az Ollama futhat lokálisan a gépeden, vagy csatlakozhatsz egy szerverhez is.

# OLLAMA_RUN_FROM_DIALOG_LOCAL
source: Run locally
hu: Indítás lokálisan

# OLLAMA_RUN_FROM_DIALOG_REMOTE
source: Connect to a server
hu: Csatlakozás szerverhez

# OLLAMA_NOT_INSTALLED_DESC
source: Would you like to download it?
hu: Szeretnéd letölteni?

source: Download
hu: Letöltés

# OLLAMA_REMOTE_DIALOG_TITLE
source: Connecting to a remote server
hu: Csatlakozás szerverhez

# OLLAMA_REMOTE_DIALOG_DESC
source: Please enter the server's IP address and port
hu: Kérlek add meg a szerver IP címét és portját

source: No models found
hu: Nincs modell

# NO_CONNECTION_DOWNLOAD
source: No connection to download
hu: Nincs kapcsolat a letöltéshez

source: Learn more
hu: További információ

source: Context length
hu: Kontextus hossza

source: Embedding length
hu: Beágyazási hossz

source: General architecture
hu: Általános architektúra

source: Block count
hu: Blokkok száma

# TOKEN_SEC_FORMAT
source: {0} tokens/sec
hu: {0} token/mp

# MIGHT_RUN_SLOW
source: Might run slow on your system
hu: Lassan futhat a rendszereden

# DOWNLOADED_MODELS_INFO
source: {0} downloaded models ({1} GB)
hu: {0} letöltött modell ({1} GB)

source: Generation speed
hu: Generálás sebessége

source: Sort by:
hu: Rendezés:

# MODEL_SIZE
source: Size: {0}
hu: Méret: {0}

# SORT_SIZE_DESCENDING
source: Size (descending)
hu: Méret (csökkenő)

# SORT_SIZE_ASCENDING
source: Size (ascending)
hu: Méret (növekvő)

# SORT_DOWNLOADED
source: Downloaded
hu: Letöltött

source: Model information
hu: Modell részletei

source: Back
hu: Vissza

# RESUME_DOWNLOAD
source: Resume download ({0})
hu: Letöltés folytatása ({0})

source: Delete
hu: Törlés

source: Downloading
hu: Letöltés

source: Paused
hu: Szüneteltetve

# MULTIPLE_DOWNLOADS_WARNING
source: A download is already in progress. Please cancel the current download before starting a new one.\n\nWe're working on supporting multiple downloads in the future.
hu: Egy modell letöltése már folyamatban van. Kérlek szakítsd meg a letöltést, mielőtt újabbat indítanál.\n\nDolgozunk rajta, hogy a jövőben több letöltés is elérhető legyen egyszerre.

# CONFIRM_DELETION_DIALOG_TITLE
source: Confirm deletion
hu: Törlés megerősítése

# CONFIRM_DELETION_DIALOG_DESC
source: Are you sure you want to delete {0}?
hu: Biztos, hogy törölni szeretnéd a(z) {0} modellt?

# RESTART_NEEDED_DIALOG_DESC
source: Would you like to restart the application now?
hu: Szeretnéd újraindítani az alkalmazást most?

source: Restart now
hu: Újraindítás most

source: Later
hu: Később

# REMOTE_CONNECTION
source: Remote connection: {0}
hu: Távoli kapcsolat: {0}

source: Retry
hu: Újra

source: Connecting..
hu: Csatlakozás..

# SHOW_INFORMATIONAL_SETTING
source: Show informational messages
hu: Tájékoztató információk megjelenítése

# SHOW_INFORMATIONAL_SETTING_DESC
source: Display informational messages about the model and the app's status on the top of the conversation.
hu: Információk megjelenítése a modellről és az alkalmazás állapotáról a beszélgetés tetején.

source: Reset to default
hu: Alapértelmezettre állítás

source: On
hu: Be

source: Off
hu: Ki

# SYSTEM_COLOR_SCHEME
source: Default (system)
hu: Alapértelmezett (rendszer)

# MESSAGE_GENERATION_FAILED
source: An error occurred while generating this message.
hu: Hiba történt ennek az üzenetnek a generálása során.

# DATABASE_ERROR_OCCURRED
source: A database error has occurred:
hu: Hiba történt az adatbázis művelet során:

# ERROR_DELETING_MODEL
source: Error occurred deleting model.
hu: Hiba történt a modell törlése során.
